lucasbertolossi/F28379D_temp_measurement/ADS124S08.c
}

/************************************************************************************//**
 *
 * @brief adcStartupRoutine()
 *          Startup function to be called before communicating with the ADC
 *
 * @param[in]   *adcChars  ADC characteristics
 *
 * @return      true for successful initialization
 *              false for unsuccessful initialization
 */
bool adcStartupRoutine(ADCchar_Set *adcChars)
{
    uint16_t initRegisterMap[NUM_REGISTERS] = { 0 };   // adapted from 8 bits to 16
    uint16_t status;                                // adapted from 8 bits to 16
    uint16_t i = 0;
//    uint16_t status_a = 0x4444;
//    uint16_t status_b = 0x4444;
//    uint16_t status_c = 0x4444;
//    uint16_t status_d = 0x4444;
//    uint16_t status_e = 0x4444;
//    uint16_t status_f = 0x4444;
//    uint16_t status_g = 0x4444;
//    uint16_t status_h = 0x4444;
//    uint16_t status_i = 0x4444;
//    uint16_t inpmux = 0x4444;
    uint16_t j = 0;




    // Provide additional delay time for power supply settling
    DELAY_US( DELAY_2p2MS );

    clearChipSelect();
    // Toggle nRESET pin to assure default register settings.
    toggleRESET();

    // Must wait 4096 tCLK after reset
//    DELAY_US( DELAY_4096TCLK );
    DELAY_US(1000*5);
    setChipSelect();
// TEST

    // Ensure internal register array is initialized
    restoreRegisterDefaults();


    // Write all registers
//    readMultipleRegisters( spiHdl, REG_ADDR_ID, NUM_REGISTERS );
    uint16_t countt = 10;    // number of registers to read
    uint16_t uiWriteInitialRegistersADC[10] = {0x00, 0x00, 0x24, 0x09, 0x14, 0x06, 0x07, 0xF5, 0x00, 0x10 };
    uint16_t junkk;
    uint16_t uiDataInitialTx[2];

    // clear junk
    while(SpiaRegs.SPIFFRX.bit.RXFFST != 0) {
        junkk = SpiaRegs.SPIRXBUF;
    }
    junkk = SpiaRegs.SPIRXBUF;

    uiDataInitialTx[0] = OPCODE_WREG + (0x00 & 0x1f);
    uiDataInitialTx[1] = countt-1;

    clearChipSelect();
    xferWord(uiDataInitialTx[0]);
    xferWord(uiDataInitialTx[1]);
    for(i = 0; i < countt; i++)
    {
        xferWord(uiWriteInitialRegistersADC[i]);
//        if(regnum+i < NUM_REGISTERS)
//            registers[regnum+i] = data[i];
    }
    setChipSelect();

    // Read back all registers
//    readMultipleRegisters( spiHdl, REG_ADDR_ID, NUM_REGISTERS );
    uint16_t count = 10;    // number of registers to read
    uint16_t uiInitialRegistersADC[10] = {0};
    uint16_t uiDataTx[2];
    uint16_t junk;
    while(SpiaRegs.SPIFFRX.bit.RXFFST != 0) {
        junk = SpiaRegs.SPIRXBUF;
    }
    junk = SpiaRegs.SPIRXBUF;
    uiDataTx[0] = OPCODE_RREG + (0x00 & 0x1f);
    uiDataTx[1] = count-1;
    clearChipSelect();
    xferWord(uiDataTx[0]);
    xferWord(uiDataTx[1]);
    for(i = 0; i < count; i++)
    {
        uiInitialRegistersADC[i] = xferWord(0);
//        if(regnum+i < NUM_REGISTERS)
//            registers[regnum+i] = data[i];
    }
    setChipSelect();
//    registerMap[REG_ADDR_ID] = regRead(REG_ADDR_ID);
//    registerMap[REG_ADDR_STATUS] = regRead(REG_ADDR_STATUS);
//    registerMap[REG_ADDR_INPMUX] = regRead(REG_ADDR_INPMUX);
//    registerMap[REG_ADDR_PGA] = regRead(REG_ADDR_PGA);
//    registerMap[REG_ADDR_DATARATE] = regRead(REG_ADDR_DATARATE);
//    registerMap[REG_ADDR_REF] = regRead(REG_ADDR_REF);
//    registerMap[REG_ADDR_IDACMAG] = regRead(REG_ADDR_IDACMAG);
//    registerMap[REG_ADDR_IDACMUX] = regRead(REG_ADDR_IDACMUX);
//    registerMap[REG_ADDR_VBIAS] = regRead(REG_ADDR_VBIAS);
//    registerMap[REG_ADDR_SYS] = regRead(REG_ADDR_SYS);

// TEST
    status = regRead(REG_ADDR_STATUS);
    if ( (status & ADS_nRDY_MASK) ) {
        return( false );                      // Device not ready
    }

    // Ensure internal register array is initialized
    restoreRegisterDefaults();

    // Configure initial device register settings here
    initRegisterMap[REG_ADDR_STATUS]  = 0x00;                      // Reset POR event
    initRegisterMap[REG_ADDR_INPMUX]  = adcChars->inputMuxConfReg;
    initRegisterMap[REG_ADDR_PGA]     = adcChars->pgaReg;
    initRegisterMap[REG_ADDR_DATARATE]= adcChars->dataRateReg;
    initRegisterMap[REG_ADDR_REF]     = adcChars->refSelReg;
    initRegisterMap[REG_ADDR_IDACMAG] = adcChars->IDACmagReg;
    initRegisterMap[REG_ADDR_IDACMUX] = adcChars->IDACmuxReg;
    initRegisterMap[REG_ADDR_VBIAS]   = adcChars->VBIASReg;
    initRegisterMap[REG_ADDR_SYS]     = SYS_DEFAULT;

    // Initialize ADC Characteristics
    adcChars->resolution     = ADS124S08_BITRES;
    adcChars->VBIASReg       = VBIAS_DEFAULT;
    adcChars->offsetCalCoeff = 0;
    adcChars->gainCalCoeff   = 1;
    adcChars->sampleRate     = 20;      // 20 samples per second
    adcChars->pgaGain        = pow(2, (adcChars->pgaReg & ADS_GAIN_MASK) );

    // Write to all modified registers
//    writeMultipleRegisters( spiHdl, REG_ADDR_STATUS, REG_ADDR_SYS - REG_ADDR_STATUS + 1, initRegisterMap );
    // Can improve this following part in the future
    regWrite(REG_ADDR_ID, 0x00);
    regWrite(REG_ADDR_STATUS, 0x00);
    regWrite(REG_ADDR_INPMUX, adcChars->inputMuxConfReg);
    regWrite(REG_ADDR_PGA, adcChars->pgaReg);
    regWrite(REG_ADDR_DATARATE, adcChars->dataRateReg);
    regWrite(REG_ADDR_REF, adcChars->refSelReg);
    regWrite(REG_ADDR_IDACMAG, adcChars->IDACmagReg);
    regWrite(REG_ADDR_IDACMUX, adcChars->IDACmuxReg);
    regWrite(REG_ADDR_VBIAS, adcChars->VBIASReg);
    regWrite(REG_ADDR_SYS, SYS_DEFAULT);

    DELAY_US(10);
//    regWrite(REG_ADDR_ID, 0x00);
//    regWrite(REG_ADDR_STATUS, 0x00);
//    regWrite(REG_ADDR_INPMUX, adcChars->inputMuxConfReg);
//    regWrite(REG_ADDR_PGA, adcChars->pgaReg);
//    regWrite(REG_ADDR_DATARATE, adcChars->dataRateReg);
//    regWrite(REG_ADDR_REF, adcChars->refSelReg);
//    regWrite(REG_ADDR_IDACMAG, adcChars->IDACmagReg);
//    regWrite(REG_ADDR_IDACMUX, adcChars->IDACmuxReg);
//    regWrite(REG_ADDR_VBIAS, adcChars->VBIASReg);
//    regWrite(REG_ADDR_SYS, SYS_DEFAULT);

//    setChipSelect();
//
//    clearChipSelect();

    // Read back all registers
//    readMultipleRegisters( spiHdl, REG_ADDR_ID, NUM_REGISTERS );
    registerMap[REG_ADDR_STATUS] = regRead(REG_ADDR_STATUS);
    registerMap[REG_ADDR_INPMUX] = regRead(REG_ADDR_INPMUX);
    registerMap[REG_ADDR_PGA] = regRead(REG_ADDR_PGA);
    registerMap[REG_ADDR_DATARATE] = regRead(REG_ADDR_DATARATE);
    registerMap[REG_ADDR_REF] = regRead(REG_ADDR_REF);
    registerMap[REG_ADDR_IDACMAG] = regRead(REG_ADDR_IDACMAG);
    registerMap[REG_ADDR_IDACMUX] = regRead(REG_ADDR_IDACMUX);
    registerMap[REG_ADDR_VBIAS] = regRead(REG_ADDR_VBIAS);
    registerMap[REG_ADDR_SYS] = regRead(REG_ADDR_SYS);



